---
title: ColumnInsideWallFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ColumnInsideWallFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ColumnInsideWallFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ColumnInsideWall { get; }` | `ColumnInsideWallFailures.ColumnInsideWall` | FailureDefinitionId |
| `FailureDefinitionId CopingWarningExtension { get; }` | `ColumnInsideWallFailures.CopingWarningExtension` | FailureDefinitionId |
| `FailureDefinitionId CopingWarningIgnored { get; }` | `ColumnInsideWallFailures.CopingWarningIgnored` | FailureDefinitionId |
| `FailureDefinitionId CopingWarningMedium { get; }` | `ColumnInsideWallFailures.CopingWarningMedium` | FailureDefinitionId |
| `FailureDefinitionId CopingWarningOffset { get; }` | `ColumnInsideWallFailures.CopingWarningOffset` | FailureDefinitionId |
| `FailureDefinitionId StartCutShadowJoin { get; }` | `ColumnInsideWallFailures.StartCutShadowJoin` | FailureDefinitionId |
| `FailureDefinitionId StopCutShadowJoin { get; }` | `ColumnInsideWallFailures.StopCutShadowJoin` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```